# Practical Pandas for Data Wrangling
## Objectives
- read data using Pandas
- explore and analyze the data
- apply transformations to the data

# [10] Basic Mechanics of Pandas
Let's get familiar with the basic mechanics of the Pandas library.

In [40]:
url = "https://s3.amazonaws.com/python-level-2/sales-funnel.csv"

In [41]:
import pandas as pd

In [42]:
df = pd.read_csv(url)

In [7]:
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

**Let's see what columns are available.**

**Let's examine the beginning (head) and end (tail) of the data set**

**Let's examine the data types in this data set**

**Let's check out descriptive statistics**

# [30] Filtering
One of the main things we'll do on our data set is filter to the records that are relevant, where the definition of what is relevant depends on the problem we are trying to solve.

In [9]:
df[df['Status']  == 'won']

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won

## Exercise
How many accounts have a price greater than $12,000?

**Let's see how we get the maximum value of a certain column.**

## https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html

In [10]:
df['Quantity'].max()

5

## Exercise
What is the minimum contract price? What is the mean? And the standard deviation?

**Let's see how we can combine Boolean Masks to filter on multiple criteria.**

In [11]:
status_won = df['Status'] == 'won'

**Let's see what the result of this operation is...**

In [12]:
status_won

0     False
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13     True
14     True
15    False
16    False
Name: Status, dtype: bool

In [13]:
product_cpu = df['Product'] == 'CPU'

In [15]:
df[status_won & product_cpu]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won

**As an aside, there are many useful series methods, for example `unique`**

In [16]:
df['Product'].unique()

array(['CPU', 'Software', 'Maintenance', 'Monitor'], dtype=object)

## Exercise
What is the total `Amount` (hint: you'll need to create a new column) for contracts that match following criteria

```
product either CPU or Software or Maintenance
manager is either Fred or Debra
```

# [20] Aggregating Data / Pivot Tables

**Sometimes it's useful to get an aggregate view of our data.**

## https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html

Let's step through the following together!

**Let's pivot on one index.**

In [20]:
pd.pivot_table(df, index='Manager')

                     Account         Price  Quantity
Manager
Debra Henley   513112.222222  26111.111111  1.444444
Fred Anderson  405039.000000  35875.000000  2.125000

**Let's pivot on multiple indices**

**Let's reverse those indices**

**Let's specify which values we care about**

**Let's specify which columns we want broken down**

**Let's specify how we want the values to be aggregated (`aggfunc`)**

**Let's fill N/A values**

**Let's get subtotals**

## Exercise
Create our own pivots that you think will be useful and then let's share and discuss.

# [60] Applying Transformations to the Data
## This is the "fun" part (it can be!) of data wrangling

In [43]:
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

**Let's look at Python dictionaries.**
Let's make note of the syntax.

In [56]:
course_catalog = {
    'AST101': 'Astronomy 101: The Solar System',
    'MATH101': 'Pre-Algebra',
    'ENG304': 'Shakespeare and Donne'
}

In [49]:
course_catalog['AST101']

'Astronomy 101: The Solar System'

In [53]:
course_catalog['AST102']

In [54]:
'ENG304' in course_catalog

True

In [57]:
'Pre-Algebra' in course_catalog.items()

False

In [59]:
CLIENT_CATEGORY_MAP = {
    'Trantow-Barrows': 'Accounting',
    'Fritsch, Russel and Anderson': 'Legal',
    'Kiehn-Spinka': 'Manufacturing',
    'Kulas Inc': 'Manufacturing',
    'Jerde-Hilpert': 'Accounting',
    'Barton LLC': 'Enterprise',
    'Herman LLC':  'Enterprise',
    'Purdy-Kunde': 'Legal',
    'Stokes LLC': 'Enterprise',
    'Kassulke, Ondricka and Metz': "Legal",
    'Koepp Ltd': 'Shipping',
    'Keeling LLC': "Enterprise"
    
}

**Let's create a new column based on the above mapping and call it "Client_Category**

**Now let's work with a different data set and keep practicing data munging!**

In [25]:
df = pd.read_csv(
    "https://raw.githubusercontent.com/suneel0101/lesson-plan/master/crunchbase_monthly_export.csv",
)

**What happened?**

In [26]:
df = pd.read_csv(
    "https://raw.githubusercontent.com/suneel0101/lesson-plan/master/crunchbase_monthly_export.csv",
    encoding='ISO-8859-1'
)

In [28]:
df.head()

,permalink,name,homepage_url,category_list,market,funding_total_usd,status,country_code,state_code,region,city,funding_rounds,founded_at,founded_month,founded_quarter,founded_year,first_funding_at,last_funding_at,Unnamed: 18
0,/organization/canal-do-credito,Canal do Credito,http://www.canaldocredito.com.br,|Credit|Technology|Services|Finance|,Credit,"750,000",NaN,BRA,NaN,Rio de Janeiro,Belo Horizonte,1,NaN,NaN,NaN,NaN,1/1/10,1/1/10,NaN
1,/organization/waywire,#waywire,http://www.waywire.com,|Entertainment|Politics|Social Media|News|,Entertainment,"1,750,000",acquired,USA,NY,New York City,New York,1,6/1/12,2012-06,2012-Q2,2012.0,6/30/12,6/30/12,NaN
2,/organization/tv-communications,&TV Communications,http://enjoyandtv.com,|Games|,Games,"4,000,000",operating,USA,CA,Los Angeles,Los Angeles,2,NaN,NaN,NaN,NaN,6/4/10,9/23/10,NaN
3,/organization/rock-your-paper,'Rock' Your Paper,http://www.rockyourpaper.org,|Publishing|Education|,Education,"40,000",operating,EST,NaN,Tallinn,Tallinn,1,10/26/12,2012-10,2012-Q4,2012.0,8/9/12,8/9/12,NaN
4,/organization/in-touch-network,(In)Touch Network,http://www.InTouchNetwork.com,|Electronics|Guides|Coffee|Restaurants|Music|i...,Apps,"1,500,000",operating,GBR,NaN,London,London,1,4/1/11,2011-04,2011-Q2,2011.0,4/1/11,4/1/11,NaN

In [31]:
# Any issues?
df.dtypes

permalink               object
name                    object
homepage_url            object
category_list           object
 market                 object
 funding_total_usd      object
status                  object
country_code            object
state_code              object
region                  object
city                    object
funding_rounds           int64
founded_at              object
founded_month           object
founded_quarter         object
founded_year           float64
first_funding_at        object
last_funding_at         object
Unnamed: 18            float64
dtype: object

## Exercise
- Get descriptive statistics
- Look at datatypes, any issues?
- Get unique values for each of the column and see what they are (in particular category_list, market, status, and region)

## Exercise
Write a function that takes a value like what we see in `funding_total_usd` and returns a numeric value. Call it `transform_funding_total`, for exampe:

```python
def transform_funding_total(value):
    # some logic
    # transformed_value = ...
    return transformed_value
```

So that when it's called, it does the following:

```
>>> transform_funding_total('1,230,200')
1230200
```

**Now let's apply it and transform the column in question**

## Exercise (hint: Pivots)
- What is the average number of funding rounds for companies in NYC?

## Exercise
What are the top 3 markets with the highest average funding total per company?